<a href="https://colab.research.google.com/github/NDSUKESH/sql-learning/blob/main/sql_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect("data.db")

In [3]:
conn.execute('''create table employee
(
  id int,
  fname varchar(20),
  lname varchar(20),
  age int,
  department varchar(20),
  salary int
);''')
conn.commit()

In [4]:
a=conn.execute("Select * From employee")
for r in a:
  print(r)

In [5]:
conn.execute("insert into employee values(1,'john','wick',43,'finance',100)")
conn.commit()

In [6]:
conn.execute("insert into employee values(2,'david','bech',25,'manager',1000)")
conn.execute("insert into employee values(3,'zyan','malik',30,'hr',500)")
conn.execute("insert into employee values(4,'harry','styles',29,'entertainment',700)")
conn.execute("insert into employee values(5,'steve','smith',39,'finance',75)")
conn.execute("insert into employee values(6,'ab','ab',40,'manager',130)")
conn.execute("insert into employee values(7,'virat','kohli',33,'entertainment',1000)")
conn.execute("insert into employee values(8,'MS','d',50,'hr',800)")
conn.execute("insert into employee values(9,'king','k',23,'finance',300)")
conn.execute("insert into employee values(10,'max','well',31,'manager',400)")
conn.execute("insert into employee values(11,'gueen','19',39,'entertainment',900)")
conn.execute("insert into employee values(12,'adam','ben',44,'hr',600)")
conn.commit()

In [7]:
a=conn.execute("Select * From employee")
for r in a:
  print(r)

(1, 'john', 'wick', 43, 'finance', 100)
(2, 'david', 'bech', 25, 'manager', 1000)
(3, 'zyan', 'malik', 30, 'hr', 500)
(4, 'harry', 'styles', 29, 'entertainment', 700)
(5, 'steve', 'smith', 39, 'finance', 75)
(6, 'ab', 'ab', 40, 'manager', 130)
(7, 'virat', 'kohli', 33, 'entertainment', 1000)
(8, 'MS', 'd', 50, 'hr', 800)
(9, 'king', 'k', 23, 'finance', 300)
(10, 'max', 'well', 31, 'manager', 400)
(11, 'gueen', '19', 39, 'entertainment', 900)
(12, 'adam', 'ben', 44, 'hr', 600)

1.Retrieve the list of employees who have the highest salary in each department.Expected Output: List of employees with their department name and corresponding highest salary.

In [8]:
a=conn.execute("select fname,lname,max(salary) as top,department from employee group by department;")

In [9]:
for r in a:
  print(r)

('virat', 'kohli', 1000, 'entertainment')
('king', 'k', 300, 'finance')
('MS', 'd', 800, 'hr')
('david', 'bech', 1000, 'manager')

2.Calculate the total salary expense for each department

In [10]:
a=conn.execute("select department ,sum(salary) as expenses from employee group by department;")
for r in a:
  print(r)

('entertainment', 2600)
('finance', 475)
('hr', 1900)
('manager', 1530)

3.Retrieve the list of employees whose last name starts with 'A' and have a salary greater than 100.

In [11]:
a=conn.execute("select fname from employee where fname like 'a%' and salary >100")
for r in a:
  print(r)

('ab',)
('adam',)

4.Calculate the average salary of employees in each department and display the result rounded to two decimal places.

In [12]:
a=conn.execute("select round(avg(salary),2) as sal,department  from employee group by department ;")
for r in a:
  print(r)

(866.67, 'entertainment')
(158.33, 'finance')
(633.33, 'hr')
(510.0, 'manager')

5.Retrieve the list of employees who have the same first name as their last name

In [13]:
a=conn.execute("select fname ,lname from employee where fname=lname;")
for r in a:
  print(r)

('ab', 'ab')

6.Retrieve the list of employees who have salary below avg

In [18]:
a=conn.execute("select fname,salary from employee where salary <(select avg(salary) from employee);")
for r in a:
  print(r)

('john', 100)
('zyan', 500)
('steve', 75)
('ab', 130)
('king', 300)
('max', 400)

In [26]:
a=conn.execute("select fname,salary from employee where  'john' in(fname);")
for r in a:
  print(r)

('john', 100)